<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the latest Microsoft Office 2016 Excel full installer package.

Set the REGION key to:

525135 for Americas (default)
532574 for Europe
532582 for Asia</string>
    <key>Identifier</key>
    <string>com.github.autopkg.office-recipes.download.MicrosoftExcel</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>Microsoft Excel</string>
        <key>REGION</key>
        <string>525135</string>
        <key>DOWNLOAD_URL_BASE</key>
        <string>https://go.microsoft.com/fwlink/?linkid=</string>
    </dict>
    <key>MinimumVersion</key>
    <string>0.4.1</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>OfficeSuiteSKULessVersionProvider</string>
        </dict>
        <dict>
            <key>Processor</key>
            <string>URLDownloader</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>%DOWNLOAD_URL_BASE%%REGION%</string>
                <key>filename</key>
                <string>%NAME%-%version%.pkg</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
        <dict>
            <key>Processor</key>
            <string>CodeSignatureVerifier</string>
            <key>Arguments</key>
            <dict>
                <key>input_path</key>
                <string>%pathname%</string>
                <key>expected_authority_names</key>
                <array>
                    <string>Developer ID Installer: Microsoft Corporation (UBF8T346G9)</string>
                    <string>Developer ID Certification Authority</string>
                    <string>Apple Root CA</string>
                </array>
            </dict>
        </dict>
    </array>
</dict>
</plist>
