<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest Excel 2016 update (or standalone) pkg and uploads to LANrev,
and appends the type and version to the end of the filename.

MSLOCALE sets the locale for a descriptive text that will be
extracted from the Microsoft update metadata. See
https://msdn.microsoft.com/en-us/goglobal/bb964664.aspx
for more information about locale IDs. Defaults to 1033 for English.

TYPE supports 'Combo', 'Delta', and 'Standalone' options.</string>
	<key>Identifier</key>
	<string>com.github.autopkg.office-recipes.lanrev.MicrosoftExcel</string>
	<key>Input</key>
	<dict>
		<key>MSLOCALE</key>
		<string>1033</string>
		<key>MSPRODUCT</key>
		<string>Excel</string>
		<key>MSTYPE</key>
		<string>Combo</string>
		<key>NAME</key>
		<string>Microsoft Excel</string>
		<key>min_os</key>
		<string>OSX10.10</string>
	</dict>
	<key>MinimumVersion</key>
	<string>0.4.2</string>
	<key>ParentRecipe</key>
	<string>com.github.autopkg.office-recipes.download.MicrosoftExcel</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>dest_payload_path</key>
				<string>%RECIPE_CACHE_DIR%/%NAME%-%version%.amsdpackages</string>
				<key>import_pkg_to_servercenter</key>
				<true/>
				<key>sdpackages_ampkgprops_path</key>
				<string>%RECIPE_DIR%/%NAME%-Defaults.ampkgprops</string>
				<key>source_payload_path</key>
				<string>%pathname%</string>
			</dict>
			<key>Processor</key>
			<string>com.github.jbaker10.LANrevImporter/LANrevImporter</string>
		</dict>
	</array>
</dict>
</plist>
