<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the latest Outlook 2016 (standalone) package installer and then 
copies the package to the DeployStudio packages repository.
Requires the office-recipes repo (currently https://github.com/arubdesu/office-recipes,
eventually to be merged into autopkg/office-recipes).

See the parent download recipe if you wish to download from a particular region.

Input keys from this recipe:
- DS_PKGS_PATH is the path for the Packages folder in the DeployStudio repository 
  (trailing slash not required/desired).   The path does not need to be on the same volume
  as the cache, as the pkg is being duplicated.
- DS_NAME is what the final package will be called in DeployStudio, regardless of what was 
  generated by the parent recipe. It defaults to %NAME% (just the app name).
</string>
    <key>Identifier</key>
    <string>com.github.autopkg.office-recipes.ds.MicrosoftOutlook</string>
    <key>Input</key>
    <dict>
        <key>DS_PKGS_PATH</key>
        <string>/Volumes/DSServer/Users/Shared/Deploy/Packages</string>
        <key>DS_NAME</key>
        <string>%NAME%</string>
    </dict>
    <key>MinimumVersion</key>
    <string>0.4.2</string>
    <key>ParentRecipe</key>
    <string>com.github.autopkg.office-recipes.download.MicrosoftOutlook</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>StopProcessingIf</string>
            <key>Arguments</key>
            <dict>
                <key>predicate</key>
                <string>download_changed == FALSE</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>Copier</string>
            <key>Arguments</key>
            <dict>
                <key>source_path</key>
                <string>%pathname%</string>
                <key>destination_path</key>
                <string>%DS_PKGS_PATH%/%DS_NAME%.pkg</string>
                <key>overwrite</key>
                <true/>
            </dict>
        </dict>
    </array>
</dict>
</plist>