<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest Microsoft Office 2019 PowerPoint full installer package.
Default channel option is the 'stable' official release, you can get InsiderSlow
or InsiderFast versions by using those exact names with the Channel input in your override.
</string>
	<key>Identifier</key>
	<string>com.github.arubdesu.office-recipes.download.MicrosoftPowerPoint2019</string>
	<key>Input</key>
	<dict>
		<key>SHORTNAME</key>
		<string>PowerPoint</string>
		<key>CHANNEL</key>
		<string>Production</string>
	</dict>
	<key>MinimumVersion</key>
	<string>0.4.1</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Processor</key>
			<string>MSOffice2019VersionProvider</string>
			<key>Arguments</key>
			<dict>
				<key>product</key>
				<string>%SHORTNAME%</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>URLDownloader</string>
			<key>Arguments</key>
			<dict>
				<key>url</key>
				<string>%URL%</string>
				<key>filename</key>
				<string>Microsoft%SHORTNAME%-%version%.pkg</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>EndOfCheckPhase</string>
		</dict>
		<dict>
			<key>Processor</key>
			<string>CodeSignatureVerifier</string>
			<key>Arguments</key>
			<dict>
				<key>input_path</key>
				<string>%RECIPE_CACHE_DIR%/downloads/Microsoft%SHORTNAME%-%version%.pkg</string>
				<key>expected_authority_names</key>
				<array>
					<string>Developer ID Installer: Microsoft Corporation (UBF8T346G9)</string>
					<string>Developer ID Certification Authority</string>
					<string>Apple Root CA</string>
				</array>
			</dict>
		</dict>
	</array>
</dict>
</plist>
